app/controllers/student_courses_controller.rb

  def index
    @student_courses = StudentCourse.all
---
SELECT * FROM "student_courses"

  def show
    @student_course = StudentCourse.find(params[:id])
---
SELECT * FROM "student_courses" WHERE ("student_courses"."id" = 1)

  def create
    @student_course = StudentCourse.new(params[:student_course])

    respond_to do |format|
      if @student_course.save
---
INSERT INTO "student_courses" ("student_id", "created_at", "updated_at", "mark", "course_id") VALUES(1, '2012-03-06 03:07:11', '2012-03-06 03:07:11', 80, 1)